//-------------------HOME WORK 1 --------------------//
// ЗАДАЧА 10
// НАПИШІТЬ ПРОГРАМУ, ЯКА БУДЕ ВИЗНАЧАТИ ДОВЖИНУ ІМЕНІ , ЯКЩО ІМЯ БІЛЬШЕ 7
//СИМВОЛІВ, КОНСОЛЬ ВИВОДИТЬ "Wow, you  have a REALLY long name!", ЯКЩО МЕНШЕ 7
// "Your name isn't very long"

//напишіть змінну, яка буде приймати значення імені
// const name = "Alinajkjj";

// if (name.length < 7) {
//   console.log("Your name isn't very long");
// } else {
//   console.log("Wow, you have a REALLY long name!");
// }

// ЗАДАЧА 11
// Используя функцию if...else,
//напишите код, который будет спрашивать:
//"Какое официальное название JavaScript?"
//Если пользователь вводит "ECMAScript",
//то показать через alert: "Верно!"
//в противном случае отобразить:"Не знаете? ECMAScript!"

// //вводимо змінну, куди будемо записувати введене користувачем значення
// const answer = prompt("Яка офіційна назва JavaScript?");

// //вводимо змінну, якій присвобємо значення, з яким будемо порівнювати
// const value = "ECMAScript";

// //записуємо умову порівння введенного значення і фіксованого
// if (answer === value) {
//   alert("Вірно!");
// } else {
//   alert("Не знаєте? ECMAScript");
// }

// ЗАДАЧА 12
// Напишите программу, которая получит от пользователь число (количество минут) и выведет в консоль
//строку в формате часов и минут
//https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/String/padStart
// 70 === 01:10

//задати змінну, в яку буде записуватися значення у хвилинах, введених користувачем
// const minutes = Number(prompt("Введіть кількість хвилин"));
// //створюємо змінну-рядок, куди будемо записувати переформатоване значення введеного часу
// let string = "";
// //створюємо змінну, куди будемо записувати додаткові хвилини, що не поміщаються в годину, те що після двокрапки
// let extraMinutes = "";

// // створюємо змінну, в яку записується кількість цілих годин з введених хвилин
// let hours = Math.floor(minutes / 60);

// //задаємо умову перевірки кількості цілих годин
// if (hours < 10) {
//   string = "0" + hours + ":"; //якщо число годин менше 10, то додаємо перед годинами "0", а потім ставимо ":"
// } else {
//   string = hours + ":"; //якщо число годин більше 10, то лише додаємо після годин ":"
// }

// //щоб знайти хвилини extraMinutes після двокрапки, потрібно від введених хвилин minutes
// //відняти отримані години hour, що помножені на 60

// extraMinutes = minutes - hours * 60;

// //перевіряємо додаткові хвилини, тому що якщо введене значення minutes кратне 60, то extraMinutes порахує як 0,
// //а нам потрібно, щоб був запис 01:00
// if (extraMinutes === 0) {
//   extraMinutes = "00"; //змінній додаткових хвилин присвоюємо "00"
// } else if (extraMinutes >= 1 && extraMinutes <= 9) {
//   //але якщо extraMinutes від 1 до 9, то теж потрібно умову
//   //щоб перед цифрою стояв на виході 0, типу 01
//   extraMinutes = "0" + extraMinutes;
// }

// string = minutes + " === " + string + extraMinutes; //до рядка, де були записані цілі години додаємо додаткові хвилини

// console.log(string);

// ЗАДАЧА 13
//При помощи цикла for додайте все четные числа от   min до max

//задаємо min i max
// const min = 2;
// const max = 4;
// let totalSum = 0;

// //задаємо цикл від min до max
// for (i = min; i <= max; i += 1) {
//   if (i % 2 === 0) {
//     //перевіряємо парність числа
//     totalSum += i;
//   }
// }

// console.log(totalSum);

// ЗАДАЧА 15
// При загрузке страницы пользователю предлагается
// в prompt ввести число. Ввод добавляется к значению
// переменной total.
// Операция ввода числа продолжается до тех пор,
// пока пользователь не нажмет кнопку Cancel в prompt.
// После того как пользователь прекратил ввод нажав на
// кнопку Cancel, показать alert со строкой "Общая сумма введенных чисел равна [число]."
// Делать проверку,что пользователь ввел именно число,
// а не произвольный набор символов, не нужно.

// let input;
// let total = 0;

// do {
//   input = prompt("Введіть число");
//   let num = Number(input);
//   total += num;
// } while (input !== null);

// alert(`Загальна сума введених чисел рівна ${total}`);

// ЗАДАЧА 14
// Напишите код, который будет спрашивать +
//логин с помощью prompt и логировать результат +
//в консоль браузера +

//Если посетитель вводит "Админ", +
//то prompt запрашивает пароль. +
//Если ничего не ввели или нажата клавиша Esc
//вывести строку "Отменено"
//В противном случае вывести строку "Я вас не знаю" +

//Пароль проверять так:
//Если введён пароль "Я главный", +
//то вывести строку "Здравствуйте!" +
//иначе выводить строку "Неверный пароль!" +

// let input;
// const loginAdmin = "Admin";

// input = prompt("Enter your login"); //вводимо  логін
// console.log(input); //виводимо логін в консоль

// if (input === loginAdmin) {
//   do {
//     input = prompt("Enter your password"); //просимо ввести пароль

//     if (input === null || input === "") {
//       //якщо натиснута ESC або пустий рядок
//       console.log("No enter"); //то  виводимо повідомлення, що немає входу. Але якщо умова хибна йдемо далі
//     } else if (input !== "I'm main") {
//       // якщо пароль не вірний
//       console.log("Uncorrect password"); //виводимо повідомлення
//     } else {
//       //якщо жодна умова не вірна, то припиняємо перевірку і виходимо з циклу
//       break;
//     }
//   } while (input !== "I'm main"); //цикл виконується, доки не введено ось такий пароль

//   console.log("Hello!");
// } else console.log("I don't know who are you");

//то виводимо ось таке повідомлення
//input = prompt("Enter correct login"); //просимо ввести коректний логін
//console.log(input); //виводимо його в консоль
// вивомо привітання у разі вірного паролю

// цикл буде працювати доти, доки не введено вірний пароль,
// лише тоді модальне вікно закриється при натисненні ok

// const login = prompt("Enter login");
// if (login === null || login === "") {
//   alert("No enter");
// } else if (login === "Admin") {
//   const password = prompt("Enter password");
//   if (password === null || password === "") {
//     alert("No enter");
//   } else if (password === "I'm main") {
//     alert("Welcome");
//   } else {
//     alert("No enter");
//   }
// } else {
//   alert("I don't know who are you");
// }

// ЗАДАЧА 16-17
//  В переменной min лежит число от 0 до 59.
// Определите в какую четверть часа попадает
// это число(в первую, вторую, третью или четвертую).

// const max = 59;

// const min = Number(prompt("Введіть число від 0 до 59"));

// if (min >= 0 && min <= 15) {
//   console.log(`Число ${min} належить до І-ї чверті`);
// } else if (min >= 16 && min <= 30) {
//   console.log(`Число ${min} належить до ІI-ї чверті`);
// } else if (min >= 31 && min <= 45) {
//   console.log(`Число ${min} належить до ІII-ї чверті`);
// } else if (min >= 46 && min <= 59) {
//   console.log(`Число ${min} належить до IV-ї чверті`);
// } else {
//   console.log(`Число ${min} не належить до жодної чверті`);
// }

// ЗАДАЧА 18

// Дана строка, состоящая из символов, например, 'abcde'.
// Проверьте, что первым символом этой строки является буква 'a'.
// Если это так - выведите 'да', в противном случае выведите 'нет'.

//вводимо рядок символів
// const string = prompt(
//   "Введіть рядок, що складається лише з букв. Вводити можна в довільному регістрі"
// );

// stringToLowerCase = string.toLowerCase();

// if (stringToLowerCase.slice(0, 1) === "a") {
//   console.log("Так");
// } else {
//   console.log("No");
// }
